{"id":"09714440-e25c-11ed-851d-6fccd92f156d","updated_at":"2023-04-27T08:06:52.914Z","updated_by":"aung.mk","created_at":"2023-04-24T04:54:04.871Z","created_by":"aung.mk","name":"EvilExtractor All in one info-stealer activity detected ","tags":["info-stealer"],"interval":"5m","enabled":true,"revision":6,"description":"EvilExtractor (sometimes spelled Evil Extractor) is an attack tool designed to target Windows operating systems and extract data and files from endpoint devices. It includes several modules that all work via an FTP service. It was developed by a company named Kodex, which claims it is an educational tool. However, research conducted by FortiGuard Labs shows cybercriminals are actively using it as an info stealer.","risk_score":99,"severity":"critical","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://172.16.172.18:5601/s/abc/app/security"},"author":["Aung Myo Khant"],"false_positives":[],"from":"now-360s","rule_id":"5811259d-3379-45c2-b675-6e33f1a7bace","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://www.fortinet.com/blog/threat-research/evil-extractor-all-in-one-stealer"],"version":6,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["logs-*","logs-windows*"],"query":"(event.category: network and source.ip: \"193.42.33.232\")\nor\n(event.code: 11 and file.name: \"KK2023.zip\" and file.path: */IMP_Data/*)\nor\n(event.code: 11 and file.name: \"Confirm.zip\" and file.path: */KeyLogs/*)\nor\n(event.code: 11 and file.name: \"MnMs.zip\" and file.path: */*Webcam/*)\nor\n(event.code: 11 file and file.name: \"Credentials.txt\")\n","filters":[],"threshold":{"field":[],"value":1,"cardinality":[]},"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
