{"id":"4d3b0560-fb81-11ed-bfcb-d7eff9bebbdd","updated_at":"2023-05-26T04:53:50.366Z","updated_by":"aung.mk","created_at":"2023-05-26T04:53:48.844Z","created_by":"aung.mk","name":"Iranian Threat Actor AKA [Agrius] Deployed MoneyBird Ransomware Behaviors. [via File-Event]","tags":[],"interval":"5m","enabled":true,"revision":1,"description":"This rule can detect the MoneyBird ransomware behavior encryption logic ransomware sample from file event.","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://172.16.172.18:5601/s/grg/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"349e36ed-1cae-4de7-b372-8584c0e418f1","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"technique":[{"id":"T1546","reference":"https://attack.mitre.org/techniques/T1546","name":"Event Triggered Execution","subtechnique":[{"id":"T1546.004","reference":"https://attack.mitre.org/techniques/T1546/004","name":"Unix Shell Configuration Modification"}]}]}],"to":"now","references":["https://research.checkpoint.com/2023/agrius-deploys-moneybird-in-targeted-attacks-against-israeli-organizations/"],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["logs-*","logs-windows*","logs-system*"],"query":"file.path.text:(\"*\\\\moneybird\\\\Shiftlibgcrypt\\\\cipher\\\\*\" OR \"*\\\\moneybird\\\\Shiftlibgcrypt\\\\mpi\\\\*\" OR \"*\\\\moneybird\\\\Shiftlibgcrypt\\\\src\\\\*\" OR \"*\\\\moneybird\\\\Shiftlibgcrypt\\\\random\\\\*\")","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
