{"id":"4afcd930-4704-11ee-83ca-3ddd4969f2ae","updated_at":"2023-08-30T07:11:46.368Z","updated_by":"aung.mk","created_at":"2023-08-30T07:10:26.617Z","created_by":"aung.mk","name":"LittleCorporal Generated Maldoc Injection","tags":["T1055","T1204"],"interval":"5m","enabled":true,"revision":2,"description":"Detects the process injection of a LittleCorporal generated Maldoc.","risk_score":65,"severity":"high","license":"https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","output_index":"","meta":{"from":"1m"},"author":["Christian Burkard (Nextron Systems)"],"false_positives":["Unknown"],"from":"now-360s","rule_id":"7bdde3bf-2a42-4c39-aa31-a92b3e17afac","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK","technique":[{"id":"T1204","name":"User Execution","reference":"https://attack.mitre.org/techniques/T1204","subtechnique":[]}]}],"to":"now","references":["https://tdm.socprime.com/tdm/info/"],"version":2,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"lucene","index":["logs-*","winlogbeat-*","logs-windows*"],"query":"(process.executable:/.*\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ AND winlog.event_data.CallTrace:/.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Nn][Ee][Tt]\\\\[Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk]64\\\\[Vv]2\\..*/ AND winlog.event_data.CallTrace:*UNKNOWN*)","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
