{"id":"d1a5a370-27a3-11ee-8586-a7f6175a04dd","updated_at":"2023-09-08T06:44:42.439Z","updated_by":"aung.mk","created_at":"2023-07-21T08:51:45.494Z","created_by":"aung.mk","name":"Port Scanning Activity detected","tags":[],"interval":"5m","enabled":false,"revision":19,"description":"Port Scanning Activity detected","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://172.16.172.18:5601/s/abc/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"306c1e88-e452-4b0b-b97b-ec51aeab7fc7","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":19,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","data_view_id":"6b3fa375-75d7-4b11-9295-7d4b19fdfc27","query":"event.dataset : \"zeek.connection\" AND destination.ip: (192.168.0.0/16 OR 10.0.0.0/8 or 172.16.0.0/8)","filters":[],"threshold":{"field":["destination.port","source.ip"],"value":500,"cardinality":[{"field":"destination.ip","value":200}]},"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
