{"id":"e1159e80-6d91-11ee-a54b-9d449ab4ae58","updated_at":"2023-10-18T08:43:14.106Z","updated_by":"aung.mk","created_at":"2023-10-18T08:39:41.910Z","created_by":"aung.mk","name":"Suspicious SeroXen RAT Behavior Detected (via commandline)","tags":[],"interval":"5m","enabled":true,"revision":3,"description":"This rule can detect SeroXen RAT (which is in Typosquatted NuGet Package) Behavior by catching the parameters of powershell script executed by loader","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://172.16.172.18:5601/s/grg/app/security"},"author":["Aung Myo Khant"],"false_positives":[],"from":"now-360s","rule_id":"9eeb8982-5a5a-4863-a486-c300bfd4b823","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://blog.phylum.io/phylum-discovers-seroxen-rat-in-typosquatted-nuget-package/"],"version":3,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["logs-*","logs-windows*","logs-system*"],"query":"process.name: \"powershell.exe\" and process.command_line.text: (\"Invoke-WebRequest\" and \"$sleepTheGodFilePath\" and \"SilentlyContinue\" and \"cmd\" and \"/c\" )","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
