{"id":"2e4b88c0-abb0-11ee-a82c-d36d09040756","updated_at":"2024-01-05T09:52:48.184Z","updated_by":"aung.mk","created_at":"2024-01-05T09:52:48.184Z","created_by":"aung.mk","name":"Suspicious Pcalua.exe File Execution Detected","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"Adversaries may abuse utilities that allow for command execution to bypass security restrictions that limit the use of command-line interpreters. Various Windows utilities may be used to execute commands, possibly without invoking [cmd](https://attack.mitre.org/software/S0106). For example, [Forfiles](https://attack.mitre.org/software/S0193), the Program Compatibility Assistant (pcalua.exe), components of the Windows Subsystem for Linux (WSL), as well as other utilities may invoke the execution of programs and commands from a [Command and Scripting Interpreter](https://attack.mitre.org/techniques/T1059), Run window, or via scripts.","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://172.16.172.18:5601/s/grg/app/security"},"author":["Aung Myo Khant"],"false_positives":[],"from":"now-360s","rule_id":"91ed46ed-0b2d-48f7-ba5e-a34df30e36e5","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"technique":[{"id":"T1202","reference":"https://attack.mitre.org/techniques/T1202","name":"Indirect Command Execution","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*","logs-windows*","logs-system*"],"query":"process.parent.name: \"cmd.exe\" and process.name: \"pcalua.exe\" ","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
