{"id":"42d4f190-40a4-11ee-b520-0b373a412181","updated_at":"2023-08-22T04:30:33.143Z","updated_by":"aung.mk","created_at":"2023-08-22T04:27:53.917Z","created_by":"aung.mk","name":"Suspicious Rhysida Ransomware Behavior Detected by Associated CommandLine. [via Process_Creation]","tags":[],"interval":"5m","enabled":true,"revision":4,"description":" This rule can detect the rhysida ransomware Behavior using commandline to copy malware and execution","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://172.16.172.18:5601/s/abc/app/security"},"author":["Aung Myo Khant"],"false_positives":["unknown"],"from":"now-360s","rule_id":"ca990e23-6a0e-4784-af28-15ddea299633","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"technique":[]}],"to":"now","references":["https://research.checkpoint.com/2023/the-rhysida-ransomware-activity-analysis-and-ties-to-vice-society/"],"version":4,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["logs-*","logs-windows*","logs-system*"],"query":"process.command_line : (\"*-d*\" and \"*-s*\" and \"*cmd /c*\" and \"*C:\\windows\\temp*\") or file.path : */temp_l0gs*","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
